<a href="https://colab.research.google.com/github/raghavendra-1999/worklog/blob/master/day_11(05_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
##numpy random

from numpy import random
print(random.randint(1,100))  ##random integers
print(random.rand())

24
0.6729473986710782

In [2]:
##numpy random

from numpy import random
print(random.randint(1,100))  ##random integers
print(random.rand())

44
0.35040780067844923

In [3]:
a=random.randint(100,size=(3,4)).ravel()
a

array([82, 78, 51, 68, 36, 25, 99, 71,  5, 43, 19, 63])

In [4]:
random.choice(a)

99

In [0]:
## pandas
1. creating 2dictionaries

In [0]:
import pandas as pd 
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict2={'a':5,'b':6,'c':7,'d':8,'e':9}
data={"first":dict1,"second":dict2}
df=pd.DataFrame(data)
df

   first  second
a      1       5
b      2       6
c      3       7
d      4       8
e      5       9

In [0]:
import pandas as pd 
import numpy as np
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}
dict2={'a':5,'b':6,'c':7,'d':8,'f':9}
data={"first":dict1,"second":dict2}
df=pd.DataFrame(data)
df

   first  second
a    1.0     5.0
b    2.0     6.0
c    3.0     7.0
d    4.0     8.0
e    5.0     NaN
f    NaN     9.0

In [0]:
# simple dictionary --->DataFrame
d1={"name":['rahul','sreya','pranav','vikas'],"age":[19,20,21,22]}
df1=pd.DataFrame(d1)
df1

     name  age
0   rahul   19
1   sreya   20
2  pranav   21
3   vikas   22

In [0]:
## using series
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s2=pd.Series([12.32,13.65,27.89,78.5,10.58,66.66,59.66,13.66,35.66,19.66])
s3=pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data={"column1":s1,"column2":s2,"column3":s3}
df3=pd.DataFrame(data)
df3

   column1  column2 column3
0        1    12.32       a
1        2    13.65       b
2        3    27.89       c
3        4    78.50       d
4        5    10.58       e
5        6    66.66       f
6        7    59.66       g
7        8    13.66       h
8        9    35.66       i
9       10    19.66       j

In [0]:
## selecting the data from dataframe
1.loc
2.iloc

In [0]:
df3["column2"]

0    12.32
1    13.65
2    27.89
3    78.50
4    10.58
5    66.66
6    59.66
7    13.66
8    35.66
9    19.66
Name: column2, dtype: float64

In [0]:
df3[["column2","column3"]]

   column2 column3
0    12.32       a
1    13.65       b
2    27.89       c
3    78.50       d
4    10.58       e
5    66.66       f
6    59.66       g
7    13.66       h
8    35.66       i
9    19.66       j

In [0]:
#single column
df3.loc[:,"column1"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: column1, dtype: int64

In [0]:
df3.loc[:,["column1",'column2']]

   column1  column2
0        1    12.32
1        2    13.65
2        3    27.89
3        4    78.50
4        5    10.58
5        6    66.66
6        7    59.66
7        8    13.66
8        9    35.66
9       10    19.66

In [0]:
df3.loc[:,:]

   column1  column2 column3
0        1    12.32       a
1        2    13.65       b
2        3    27.89       c
3        4    78.50       d
4        5    10.58       e
5        6    66.66       f
6        7    59.66       g
7        8    13.66       h
8        9    35.66       i
9       10    19.66       j

In [0]:
#extracting multiple column values
df3.loc[0:5,["column1","column2"]]

   column1  column2
0        1    12.32
1        2    13.65
2        3    27.89
3        4    78.50
4        5    10.58
5        6    66.66